NDJSec/FALCON/knowledge_base/svd/data/Freescale/MKL28Z7.svd
        <register>
          <name>TRGMUX_FLEXIO</name>
          <description>TRGMUX TRGCFG Register</description>
          <addressOffset>0x10</addressOffset>
          <size>32</size>
          <access>read-write</access>
          <resetValue>0</resetValue>
          <resetMask>0xFFFFFFFF</resetMask>
          <fields>
            <field>
              <name>SEL0</name>
              <description>Trigger MUX Input 0 Source Select</description>
              <bitOffset>0</bitOffset>
              <bitWidth>6</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>SEL1</name>
              <description>Trigger MUX Input 1 Source Select</description>
              <bitOffset>8</bitOffset>
              <bitWidth>6</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>SEL2</name>
              <description>Trigger MUX Input 2 Source Select</description>
              <bitOffset>16</bitOffset>
              <bitWidth>6</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>SEL3</name>
              <description>Trigger MUX Input 3 Source Select</description>
              <bitOffset>24</bitOffset>
              <bitWidth>6</bitWidth>
              <access>read-write</access>
              <enumeratedValues>
                <enumeratedValue>
                  <name>0</name>
                  <description>Trigger function is disabled.</description>
                  <value>#0</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>1</name>
                  <description>Port pin trigger input is selected.</description>
                  <value>#1</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>2</name>
                  <description>FlexIO Timer 0 input is selected.</description>
                  <value>#10</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>3</name>
                  <description>FlexIO Timer 1 input is selected.</description>
                  <value>#11</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>4</name>
                  <description>FlexIO Timer 2 input is selected.</description>
                  <value>#100</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>5</name>
                  <description>FlexIO Timer 3 input is selected.</description>
                  <value>#101</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>6</name>
                  <description>FlexIO Timer 4 input is selected.</description>
                  <value>#110</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>7</name>
                  <description>FlexIO Timer 5 input is selected.</description>
                  <value>#111</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>8</name>
                  <description>FlexIO Timer 6 input is selected.</description>
                  <value>#1000</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>9</name>
                  <description>FlexIO Timer 7 input is selected.</description>
                  <value>#1001</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>10</name>
                  <description>TPM0 Overflow is selected</description>
                  <value>#1010</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>11</name>
                  <description>TPM0 Channel 0 is selected</description>
                  <value>#1011</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>12</name>
                  <description>TPM0 Channel 1 is selected</description>
                  <value>#1100</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>13</name>
                  <description>TPM1 Overflow is selected</description>
                  <value>#1101</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>14</name>
                  <description>TPM1 Channel 0 is selected</description>
                  <value>#1110</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>15</name>
                  <description>TPM1 Channel 1 is selected</description>
                  <value>#1111</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>16</name>
                  <description>LPIT1 Channel 0 is selected</description>
                  <value>#10000</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>17</name>
                  <description>LPIT1 Channel 1 is selected</description>
                  <value>#10001</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>18</name>
                  <description>LPIT1 Channel 2 is selected</description>
                  <value>#10010</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>19</name>
                  <description>LPIT1 Channel 3 is selected</description>
                  <value>#10011</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>20</name>
                  <description>LPUART0 RX Data is selected.</description>
                  <value>#10100</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>21</name>
                  <description>LPUART0 TX Data is selected.</description>
                  <value>#10101</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>22</name>
                  <description>LPUART0 RX Idle is selected.</description>
                  <value>#10110</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>23</name>
                  <description>LPUART1 RX Data is selected.</description>
                  <value>#10111</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>24</name>
                  <description>LPUART1 TX Data is selected.</description>
                  <value>#11000</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>25</name>
                  <description>LPUART1 RX Idle is selected.</description>
                  <value>#11001</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>26</name>
                  <description>LPI2C0 Master STOP is selected.</description>
                  <value>#11010</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>27</name>
                  <description>LPI2C0 Slave STOP is selected.</description>
                  <value>#11011</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>28</name>
                  <description>LPI2C1 Master STOP is selected.</description>
                  <value>#11100</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>29</name>
                  <description>LPI2C1 Slave STOP is selected.</description>
                  <value>#11101</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>30</name>
                  <description>LPSPI0 Frame is selected.</description>
                  <value>#11110</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>31</name>
                  <description>LPSPI0 RX data is selected.</description>
                  <value>#11111</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>32</name>
                  <description>LPSPI1 Frame is selected.</description>
                  <value>#100000</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>33</name>
                  <description>LPSPI1 RX data is selected.</description>
                  <value>#100001</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>34</name>
                  <description>RTC Seconds Counter is selected.</description>
                  <value>#100010</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>35</name>
                  <description>RTC Alarm is selected.</description>
                  <value>#100011</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>36</name>
                  <description>LPTMR0 Trigger is selected.</description>
                  <value>#100100</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>37</name>
                  <description>LPTMR1 Trigger is selected.</description>
                  <value>#100101</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>38</name>
                  <description>CMP0 Output is selected.</description>
                  <value>#100110</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>39</name>
                  <description>CMP1 Output is selected.</description>
                  <value>#100111</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>40</name>
                  <description>ADC0 Conversion A Complete is selected.</description>
                  <value>#101000</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>41</name>
                  <description>ADC0 Conversion B Complete is selected.</description>
                  <value>#101001</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>42</name>
                  <description>Port A Pin Trigger is selected.</description>
                  <value>#101010</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>43</name>
                  <description>Port B Pin Trigger is selected.</description>
                  <value>#101011</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>44</name>
                  <description>Port C Pin Trigger is selected.</description>
                  <value>#101100</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>45</name>
                  <description>Port D Pin Trigger is selected.</description>
                  <value>#101101</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>46</name>
                  <description>Port E Pin Trigger is selected.</description>
                  <value>#101110</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>47</name>
                  <description>TPM2 Overflow selected.</description>
                  <value>#101111</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>48</name>
                  <description>TPM2 Channel 0 is selected.</description>
                  <value>#110000</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>49</name>
                  <description>TPM2 Channel 1 is selected.</description>
                  <value>#110001</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>50</name>
                  <description>LPIT0 Channel 0 is selected.</description>
                  <value>#110010</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>51</name>
                  <description>LPIT0 Channel 1 is selected.</description>
                  <value>#110011</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>52</name>
                  <description>LPIT0 Channel 2 is selected.</description>
                  <value>#110100</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>53</name>
                  <description>LPIT0 Channel 3 is selected.</description>
                  <value>#110101</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>54</name>
                  <description>USB Start-of-Frame is selected.</description>
                  <value>#110110</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>55</name>
                  <description>LPUART2 RX Data is selected.</description>
                  <value>#110111</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>56</name>
                  <description>LPUART2 TX Data is selected.</description>
                  <value>#111000</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>57</name>
                  <description>LPUART2 RX Idle is selected.</description>
                  <value>#111001</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>58</name>
                  <description>LPI2C2 Master STOP is selected.</description>
                  <value>#111010</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>59</name>
                  <description>LPI2C2 Slave STOP is selected.</description>
                  <value>#111011</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>60</name>
                  <description>LPSPI2 Frame is selected.</description>
                  <value>#111100</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>61</name>
                  <description>LPSPI2 RX Data is selected.</description>
                  <value>#111101</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>62</name>
                  <description>SAI TX Frame Sync selected.</description>
                  <value>#111110</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>63</name>
                  <description>SAI RX Frame Sync is selected.</description>
                  <value>#111111</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
            <field>
              <name>LK</name>
              <description>Enable</description>
              <bitOffset>31</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
              <enumeratedValues>
                <enumeratedValue>
                  <name>0</name>
                  <description>Register can be written.</description>
                  <value>#0</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>1</name>
                  <description>Register cannot be written until the next system Reset.</description>
                  <value>#1</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
          </fields>
        </register>
        <register>
          <name>TRGMUX_LPUART0</name>
          <description>TRGMUX TRGCFG Register</description>
          <addressOffset>0x14</addressOffset>
          <size>32</size>
          <access>read-write</access>
          <resetValue>0</resetValue>
          <resetMask>0xFFFFFFFF</resetMask>
          <fields>
            <field>
              <name>SEL0</name>
              <description>Trigger MUX Input 0 Source Select</description>
              <bitOffset>0</bitOffset>
              <bitWidth>6</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>LK</name>
              <description>Enable</description>
              <bitOffset>31</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
              <enumeratedValues>
                <enumeratedValue>
                  <name>0</name>
                  <description>Register can be written.</description>
                  <value>#0</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>1</name>
                  <description>Register cannot be written until the next system Reset.</description>
                  <value>#1</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
          </fields>
        </register>
        <register>
          <name>TRGMUX_LPUART1</name>
          <description>TRGMUX TRGCFG Register</description>
          <addressOffset>0x18</addressOffset>
          <size>32</size>
          <access>read-write</access>
          <resetValue>0</resetValue>
          <resetMask>0xFFFFFFFF</resetMask>
          <fields>
            <field>
              <name>SEL0</name>
              <description>Trigger MUX Input 0 Source Select</description>
              <bitOffset>0</bitOffset>
              <bitWidth>6</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>LK</name>
              <description>Enable</description>
              <bitOffset>31</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
              <enumeratedValues>
                <enumeratedValue>
                  <name>0</name>
                  <description>Register can be written.</description>
                  <value>#0</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>1</name>
                  <description>Register cannot be written until the next system Reset.</description>
                  <value>#1</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
          </fields>
        </register>
        <register>
          <name>TRGMUX_LPI2C0</name>
          <description>TRGMUX TRGCFG Register</description>
          <addressOffset>0x1C</addressOffset>
          <size>32</size>
          <access>read-write</access>
          <resetValue>0</resetValue>
          <resetMask>0xFFFFFFFF</resetMask>
          <fields>
            <field>
              <name>SEL0</name>
              <description>Trigger MUX Input 0 Source Select</description>
              <bitOffset>0</bitOffset>
              <bitWidth>6</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>LK</name>
              <description>Enable</description>
              <bitOffset>31</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
              <enumeratedValues>
                <enumeratedValue>
                  <name>0</name>
                  <description>Register can be written.</description>
                  <value>#0</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>1</name>
                  <description>Register cannot be written until the next system Reset.</description>
                  <value>#1</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
          </fields>
        </register>
        <register>
          <name>TRGMUX_LPI2C1</name>
          <description>TRGMUX TRGCFG Register</description>
          <addressOffset>0x20</addressOffset>
          <size>32</size>
          <access>read-write</access>
          <resetValue>0</resetValue>
          <resetMask>0xFFFFFFFF</resetMask>
          <fields>
            <field>
              <name>SEL0</name>
              <description>Trigger MUX Input 0 Source Select</description>
              <bitOffset>0</bitOffset>
              <bitWidth>6</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>LK</name>
              <description>Enable</description>
              <bitOffset>31</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
              <enumeratedValues>
                <enumeratedValue>
                  <name>0</name>
                  <description>Register can be written.</description>
                  <value>#0</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>1</name>
                  <description>Register cannot be written until the next system Reset.</description>
                  <value>#1</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
          </fields>
        </register>
        <register>
          <name>TRGMUX_LPSPI0</name>
          <description>TRGMUX TRGCFG Register</description>
          <addressOffset>0x24</addressOffset>
          <size>32</size>
          <access>read-write</access>
          <resetValue>0</resetValue>
          <resetMask>0xFFFFFFFF</resetMask>
          <fields>
            <field>
              <name>SEL0</name>
              <description>Trigger MUX Input 0 Source Select</description>
              <bitOffset>0</bitOffset>
              <bitWidth>6</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>LK</name>
              <description>Enable</description>
              <bitOffset>31</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
              <enumeratedValues>
                <enumeratedValue>
                  <name>0</name>
                  <description>Register can be written.</description>
                  <value>#0</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>1</name>
                  <description>Register cannot be written until the next system Reset.</description>
                  <value>#1</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
          </fields>
        </register>
