NDJSec/FALCON/knowledge_base/svd/data/Freescale/MKL28Z7.svd
      </registers>
    </peripheral>
    <peripheral>
      <name>NVIC0</name>
      <description>Nested Vectored Interrupt Controller</description>
      <baseAddress>0xE000E100</baseAddress>
      <addressBlock>
        <offset>0</offset>
        <size>0x320</size>
        <usage>registers</usage>
      </addressBlock>
      <registers>
        <register>
          <name>NVIC0_ISER</name>
          <description>Interrupt Set Enable Register</description>
          <addressOffset>0</addressOffset>
          <size>32</size>
          <access>read-write</access>
          <resetValue>0</resetValue>
          <resetMask>0xFFFFFFFF</resetMask>
          <fields>
            <field>
              <name>SETENA0</name>
              <description>DMA0 channel 0/4 transfer complete interrupt set-enable bit</description>
              <bitOffset>0</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
              <enumeratedValues>
                <enumeratedValue>
                  <name>0</name>
                  <description>write: no effect; read: DMA0 channel 0/4 transfer complete interrupt disabled</description>
                  <value>#0</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>1</name>
                  <description>write: enable DMA0 channel 0/4 transfer complete interrupt; read: DMA0 channel 0/4 transfer complete interrupt enabled</description>
                  <value>#1</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
            <field>
              <name>SETENA1</name>
              <description>DMA0 channel 1/5 transfer complete interrupt set-enable bit</description>
              <bitOffset>1</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
              <enumeratedValues>
                <enumeratedValue>
                  <name>0</name>
                  <description>write: no effect; read: DMA0 channel 1/5 transfer complete interrupt disabled</description>
                  <value>#0</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>1</name>
                  <description>write: enable DMA0 channel 1/5 transfer complete interrupt; read: DMA0 channel 1/5 transfer complete interrupt enabled</description>
                  <value>#1</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
            <field>
              <name>SETENA2</name>
              <description>DMA0 channel 2/6 transfer complete interrupt set-enable bit</description>
              <bitOffset>2</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
              <enumeratedValues>
                <enumeratedValue>
                  <name>0</name>
                  <description>write: no effect; read: DMA0 channel 2/6 transfer complete interrupt disabled</description>
                  <value>#0</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>1</name>
                  <description>write: enable DMA0 channel 2/6 transfer complete interrupt; read: DMA0 channel 2/6 transfer complete interrupt enabled</description>
                  <value>#1</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
            <field>
              <name>SETENA3</name>
              <description>DMA0 channel 3/7 transfer complete interrupt set-enable bit</description>
              <bitOffset>3</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
              <enumeratedValues>
                <enumeratedValue>
                  <name>0</name>
                  <description>write: no effect; read: DMA0 channel 3/7 transfer complete interrupt disabled</description>
                  <value>#0</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>1</name>
                  <description>write: enable DMA0 channel 3/7 transfer complete interrupt; read: DMA0 channel 3/7 transfer complete interrupt enabled</description>
                  <value>#1</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
            <field>
              <name>SETENA4</name>
              <description>CTI0 or DMA0 error interrupt set-enable bit</description>
              <bitOffset>4</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
              <enumeratedValues>
                <enumeratedValue>
                  <name>0</name>
                  <description>write: no effect; read: CTI0 or DMA0 error interrupt disabled</description>
                  <value>#0</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>1</name>
                  <description>write: enable CTI0 or DMA0 error interrupt; read: CTI0 or DMA0 error interrupt enabled</description>
                  <value>#1</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
            <field>
              <name>SETENA5</name>
              <description>FLEXIO0 interrupt set-enable bit</description>
              <bitOffset>5</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
              <enumeratedValues>
                <enumeratedValue>
                  <name>0</name>
                  <description>write: no effect; read: FLEXIO0 interrupt disabled</description>
                  <value>#0</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>1</name>
                  <description>write: enable FLEXIO0 interrupt; read: FLEXIO0 interrupt enabled</description>
                  <value>#1</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
            <field>
              <name>SETENA6</name>
              <description>Timer/PWM module 0 interrupt set-enable bit</description>
              <bitOffset>6</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
              <enumeratedValues>
                <enumeratedValue>
                  <name>0</name>
                  <description>write: no effect; read: Timer/PWM module 0 interrupt disabled</description>
                  <value>#0</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>1</name>
                  <description>write: enable Timer/PWM module 0 interrupt; read: Timer/PWM module 0 interrupt enabled</description>
                  <value>#1</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
            <field>
              <name>SETENA7</name>
              <description>Timer/PWM module 1 interrupt set-enable bit</description>
              <bitOffset>7</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
              <enumeratedValues>
                <enumeratedValue>
                  <name>0</name>
                  <description>write: no effect; read: Timer/PWM module 1 interrupt disabled</description>
                  <value>#0</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>1</name>
                  <description>write: enable Timer/PWM module 1 interrupt; read: Timer/PWM module 1 interrupt enabled</description>
                  <value>#1</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
            <field>
              <name>SETENA8</name>
              <description>Timer/PWM module 2 interrupt set-enable bit</description>
              <bitOffset>8</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
              <enumeratedValues>
                <enumeratedValue>
                  <name>0</name>
                  <description>write: no effect; read: Timer/PWM module 2 interrupt disabled</description>
                  <value>#0</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>1</name>
                  <description>write: enable Timer/PWM module 2 interrupt; read: Timer/PWM module 2 interrupt enabled</description>
                  <value>#1</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
            <field>
              <name>SETENA9</name>
              <description>Low Power Periodic Interrupt Timer interrupt set-enable bit</description>
              <bitOffset>9</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
              <enumeratedValues>
                <enumeratedValue>
                  <name>0</name>
                  <description>write: no effect; read: Low Power Periodic Interrupt Timer interrupt disabled</description>
                  <value>#0</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>1</name>
                  <description>write: enable Low Power Periodic Interrupt Timer interrupt; read: Low Power Periodic Interrupt Timer interrupt enabled</description>
                  <value>#1</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
            <field>
              <name>SETENA10</name>
              <description>Serial Peripheral Interface 0 interrupt set-enable bit</description>
              <bitOffset>10</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
              <enumeratedValues>
                <enumeratedValue>
                  <name>0</name>
                  <description>write: no effect; read: Serial Peripheral Interface 0 interrupt disabled</description>
                  <value>#0</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>1</name>
                  <description>write: enable Serial Peripheral Interface 0 interrupt; read: Serial Peripheral Interface 0 interrupt enabled</description>
                  <value>#1</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
            <field>
              <name>SETENA11</name>
              <description>Serial Peripheral Interface 1 interrupt set-enable bit</description>
              <bitOffset>11</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
              <enumeratedValues>
                <enumeratedValue>
                  <name>0</name>
                  <description>write: no effect; read: Serial Peripheral Interface 1 interrupt disabled</description>
                  <value>#0</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>1</name>
                  <description>write: enable Serial Peripheral Interface 1 interrupt; read: Serial Peripheral Interface 1 interrupt enabled</description>
                  <value>#1</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
            <field>
              <name>SETENA12</name>
              <description>LPUART0 status and error interrupt set-enable bit</description>
              <bitOffset>12</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
              <enumeratedValues>
                <enumeratedValue>
                  <name>0</name>
                  <description>write: no effect; read: LPUART0 status and error interrupt disabled</description>
                  <value>#0</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>1</name>
                  <description>write: enable LPUART0 status and error interrupt; read: LPUART0 status and error interrupt enabled</description>
                  <value>#1</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
            <field>
              <name>SETENA13</name>
              <description>LPUART1 status and error interrupt set-enable bit</description>
              <bitOffset>13</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
              <enumeratedValues>
                <enumeratedValue>
                  <name>0</name>
                  <description>write: no effect; read: LPUART1 status and error interrupt disabled</description>
                  <value>#0</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>1</name>
                  <description>write: enable LPUART1 status and error interrupt; read: LPUART1 status and error interrupt enabled</description>
                  <value>#1</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
            <field>
              <name>SETENA14</name>
              <description>Inter-Integrated Circuit 0 interrupt set-enable bit</description>
              <bitOffset>14</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
              <enumeratedValues>
                <enumeratedValue>
                  <name>0</name>
                  <description>write: no effect; read: Inter-Integrated Circuit 0 interrupt disabled</description>
                  <value>#0</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>1</name>
                  <description>write: enable Inter-Integrated Circuit 0 interrupt; read: Inter-Integrated Circuit 0 interrupt enabled</description>
                  <value>#1</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
            <field>
              <name>SETENA15</name>
              <description>Inter-Integrated Circuit 0 interrupt set-enable bit</description>
              <bitOffset>15</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
              <enumeratedValues>
                <enumeratedValue>
                  <name>0</name>
                  <description>write: no effect; read: Inter-Integrated Circuit 0 interrupt disabled</description>
                  <value>#0</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>1</name>
                  <description>write: enable Inter-Integrated Circuit 0 interrupt; read: Inter-Integrated Circuit 0 interrupt enabled</description>
                  <value>#1</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
            <field>
              <name>SETENA16</name>
              <description>Reserved iv 32 interrupt set-enable bit</description>
              <bitOffset>16</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
              <enumeratedValues>
                <enumeratedValue>
                  <name>0</name>
                  <description>write: no effect; read: Reserved iv 32 interrupt disabled</description>
                  <value>#0</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>1</name>
                  <description>write: enable Reserved iv 32 interrupt; read: Reserved iv 32 interrupt enabled</description>
                  <value>#1</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
            <field>
              <name>SETENA17</name>
              <description>PORTA Pin detect interrupt set-enable bit</description>
              <bitOffset>17</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
              <enumeratedValues>
                <enumeratedValue>
                  <name>0</name>
                  <description>write: no effect; read: PORTA Pin detect interrupt disabled</description>
                  <value>#0</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>1</name>
                  <description>write: enable PORTA Pin detect interrupt; read: PORTA Pin detect interrupt enabled</description>
                  <value>#1</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
            <field>
              <name>SETENA18</name>
              <description>PORTB Pin detect interrupt set-enable bit</description>
              <bitOffset>18</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
              <enumeratedValues>
                <enumeratedValue>
                  <name>0</name>
                  <description>write: no effect; read: PORTB Pin detect interrupt disabled</description>
                  <value>#0</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>1</name>
                  <description>write: enable PORTB Pin detect interrupt; read: PORTB Pin detect interrupt enabled</description>
                  <value>#1</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
            <field>
              <name>SETENA19</name>
              <description>PORTC Pin detect interrupt set-enable bit</description>
              <bitOffset>19</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
              <enumeratedValues>
                <enumeratedValue>
                  <name>0</name>
                  <description>write: no effect; read: PORTC Pin detect interrupt disabled</description>
                  <value>#0</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>1</name>
                  <description>write: enable PORTC Pin detect interrupt; read: PORTC Pin detect interrupt enabled</description>
                  <value>#1</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
            <field>
              <name>SETENA20</name>
              <description>PORTD Pin detect interrupt set-enable bit</description>
              <bitOffset>20</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
              <enumeratedValues>
                <enumeratedValue>
                  <name>0</name>
                  <description>write: no effect; read: PORTD Pin detect interrupt disabled</description>
                  <value>#0</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>1</name>
                  <description>write: enable PORTD Pin detect interrupt; read: PORTD Pin detect interrupt enabled</description>
                  <value>#1</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
            <field>
              <name>SETENA21</name>
              <description>PORTE Pin detect interrupt set-enable bit</description>
              <bitOffset>21</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
              <enumeratedValues>
                <enumeratedValue>
                  <name>0</name>
                  <description>write: no effect; read: PORTE Pin detect interrupt disabled</description>
                  <value>#0</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>1</name>
                  <description>write: enable PORTE Pin detect interrupt; read: PORTE Pin detect interrupt enabled</description>
                  <value>#1</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
            <field>
              <name>SETENA22</name>
              <description>Low Leakage Wakeup 0 interrupt set-enable bit</description>
              <bitOffset>22</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
              <enumeratedValues>
                <enumeratedValue>
                  <name>0</name>
                  <description>write: no effect; read: Low Leakage Wakeup 0 interrupt disabled</description>
                  <value>#0</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>1</name>
                  <description>write: enable Low Leakage Wakeup 0 interrupt; read: Low Leakage Wakeup 0 interrupt enabled</description>
                  <value>#1</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
            <field>
              <name>SETENA23</name>
              <description>Integrated interchip sound 0 interrupt set-enable bit</description>
              <bitOffset>23</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
              <enumeratedValues>
                <enumeratedValue>
                  <name>0</name>
                  <description>write: no effect; read: Integrated interchip sound 0 interrupt disabled</description>
                  <value>#0</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>1</name>
                  <description>write: enable Integrated interchip sound 0 interrupt; read: Integrated interchip sound 0 interrupt enabled</description>
                  <value>#1</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
            <field>
              <name>SETENA24</name>
              <description>Universal Serial Bus interrupt set-enable bit</description>
              <bitOffset>24</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
              <enumeratedValues>
                <enumeratedValue>
                  <name>0</name>
                  <description>write: no effect; read: Universal Serial Bus interrupt disabled</description>
                  <value>#0</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>1</name>
                  <description>write: enable Universal Serial Bus interrupt; read: Universal Serial Bus interrupt enabled</description>
                  <value>#1</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
            <field>
              <name>SETENA25</name>
              <description>Analog-to-Digital Converter 0 interrupt set-enable bit</description>
              <bitOffset>25</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
              <enumeratedValues>
                <enumeratedValue>
                  <name>0</name>
                  <description>write: no effect; read: Analog-to-Digital Converter 0 interrupt disabled</description>
                  <value>#0</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>1</name>
                  <description>write: enable Analog-to-Digital Converter 0 interrupt; read: Analog-to-Digital Converter 0 interrupt enabled</description>
                  <value>#1</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
            <field>
              <name>SETENA26</name>
              <description>Low-Power Timer interrupt set-enable bit</description>
              <bitOffset>26</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
              <enumeratedValues>
                <enumeratedValue>
                  <name>0</name>
