NDJSec/FALCON/knowledge_base/svd/data/Freescale/MKL28Z7.svd
              <description>PORTE Pin detect interrupt clear-enable bit</description>
              <bitOffset>21</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
              <enumeratedValues>
                <enumeratedValue>
                  <name>0</name>
                  <description>write: no effect; read: PORTE Pin detect interrupt disabled</description>
                  <value>#0</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>1</name>
                  <description>write: disable PORTE Pin detect interrupt; read: PORTE Pin detect interrupt enabled</description>
                  <value>#1</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
            <field>
              <name>CLRENA22</name>
              <description>Low Leakage Wakeup 0 interrupt clear-enable bit</description>
              <bitOffset>22</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
              <enumeratedValues>
                <enumeratedValue>
                  <name>0</name>
                  <description>write: no effect; read: Low Leakage Wakeup 0 interrupt disabled</description>
                  <value>#0</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>1</name>
                  <description>write: disable Low Leakage Wakeup 0 interrupt; read: Low Leakage Wakeup 0 interrupt enabled</description>
                  <value>#1</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
            <field>
              <name>CLRENA23</name>
              <description>Integrated interchip sound 0 interrupt clear-enable bit</description>
              <bitOffset>23</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
              <enumeratedValues>
                <enumeratedValue>
                  <name>0</name>
                  <description>write: no effect; read: Integrated interchip sound 0 interrupt disabled</description>
                  <value>#0</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>1</name>
                  <description>write: disable Integrated interchip sound 0 interrupt; read: Integrated interchip sound 0 interrupt enabled</description>
                  <value>#1</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
            <field>
              <name>CLRENA24</name>
              <description>Universal Serial Bus interrupt clear-enable bit</description>
              <bitOffset>24</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
              <enumeratedValues>
                <enumeratedValue>
                  <name>0</name>
                  <description>write: no effect; read: Universal Serial Bus interrupt disabled</description>
                  <value>#0</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>1</name>
                  <description>write: disable Universal Serial Bus interrupt; read: Universal Serial Bus interrupt enabled</description>
                  <value>#1</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
            <field>
              <name>CLRENA25</name>
              <description>Analog-to-Digital Converter 0 interrupt clear-enable bit</description>
              <bitOffset>25</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
              <enumeratedValues>
                <enumeratedValue>
                  <name>0</name>
                  <description>write: no effect; read: Analog-to-Digital Converter 0 interrupt disabled</description>
                  <value>#0</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>1</name>
                  <description>write: disable Analog-to-Digital Converter 0 interrupt; read: Analog-to-Digital Converter 0 interrupt enabled</description>
                  <value>#1</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
            <field>
              <name>CLRENA26</name>
              <description>Low-Power Timer interrupt clear-enable bit</description>
              <bitOffset>26</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
              <enumeratedValues>
                <enumeratedValue>
                  <name>0</name>
                  <description>write: no effect; read: Low-Power Timer interrupt disabled</description>
                  <value>#0</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>1</name>
                  <description>write: disable Low-Power Timer interrupt; read: Low-Power Timer interrupt enabled</description>
                  <value>#1</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
            <field>
              <name>CLRENA27</name>
              <description>RTC seconds interrupt clear-enable bit</description>
              <bitOffset>27</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
              <enumeratedValues>
                <enumeratedValue>
                  <name>0</name>
                  <description>write: no effect; read: RTC seconds interrupt disabled</description>
                  <value>#0</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>1</name>
                  <description>write: disable RTC seconds interrupt; read: RTC seconds interrupt enabled</description>
                  <value>#1</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
            <field>
              <name>CLRENA28</name>
              <description>INTMUX0 channel 0 interrupt interrupt clear-enable bit</description>
              <bitOffset>28</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
              <enumeratedValues>
                <enumeratedValue>
                  <name>0</name>
                  <description>write: no effect; read: INTMUX0 channel 0 interrupt interrupt disabled</description>
                  <value>#0</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>1</name>
                  <description>write: disable INTMUX0 channel 0 interrupt interrupt; read: INTMUX0 channel 0 interrupt interrupt enabled</description>
                  <value>#1</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
            <field>
              <name>CLRENA29</name>
              <description>INTMUX0 channel 1 interrupt interrupt clear-enable bit</description>
              <bitOffset>29</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
              <enumeratedValues>
                <enumeratedValue>
                  <name>0</name>
                  <description>write: no effect; read: INTMUX0 channel 1 interrupt interrupt disabled</description>
                  <value>#0</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>1</name>
                  <description>write: disable INTMUX0 channel 1 interrupt interrupt; read: INTMUX0 channel 1 interrupt interrupt enabled</description>
                  <value>#1</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
            <field>
              <name>CLRENA30</name>
              <description>INTMUX0 channel 2 interrupt interrupt clear-enable bit</description>
              <bitOffset>30</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
              <enumeratedValues>
                <enumeratedValue>
                  <name>0</name>
                  <description>write: no effect; read: INTMUX0 channel 2 interrupt interrupt disabled</description>
                  <value>#0</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>1</name>
                  <description>write: disable INTMUX0 channel 2 interrupt interrupt; read: INTMUX0 channel 2 interrupt interrupt enabled</description>
                  <value>#1</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
            <field>
              <name>CLRENA31</name>
              <description>INTMUX0 channel 3 interrupt interrupt clear-enable bit</description>
              <bitOffset>31</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
              <enumeratedValues>
                <enumeratedValue>
                  <name>0</name>
                  <description>write: no effect; read: INTMUX0 channel 3 interrupt interrupt disabled</description>
                  <value>#0</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>1</name>
                  <description>write: disable INTMUX0 channel 3 interrupt interrupt; read: INTMUX0 channel 3 interrupt interrupt enabled</description>
                  <value>#1</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
          </fields>
        </register>
